Revit 2026 API

# WallSweepOrientation Enumeration

---

Represents the orientation of horizonally placed sweep's profile relative to the wall side face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WallSweepOrientation
```
```vb
Public Enumeration WallSweepOrientation
```
```cpp
public enum class WallSweepOrientation
```
```fsharp
type WallSweepOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| Horizontal | 0 | Profile is oriented horizontally regardless of wall slant angle |
| Perpendicular | 1 | Profile is perpendicular to the wall side face |

#### Reference

Autodesk.Revit.DB Namespace